import type { RegionType } from '@/types';

export const CITY_REGIONS = [
  'Улаанбаатар хот',
  'Цэцэрлэг хот',
  'Өлгий хот',
  'Баянхонгор хот',
  'Булган хот',
  'Алтай хот',
  'Чойр хот',
  'Дархан хот',
  'Сайншанд хот',
  'Чойбалсан хот',
  'Мандалговь хот',
  'Улиастай хот',
  'Арвайхээр хот',
  'Даланзадгад хот',
  'Эрдэнэт хот',
  'Баруун-Урт хот',
  'Сүхбаатар хот',
  'Зуунмод хот',
  'Улаангом хот',
  'Ховд хот',
  'Мөрөн хот',
  'Чингис хот',
] as const;

export const PROVINCE_REGIONS = [
  'Архангай аймаг',
  'Баян-Өлгий аймаг',
  'Баянхонгор аймаг',
  'Булган аймаг',
  'Говь-Алтай аймаг',
  'Говьсүмбэр аймаг',
  'Дархан-Уул аймаг',
  'Дорноговь аймаг',
  'Дорнод аймаг',
  'Дундговь аймаг',
  'Завхан аймаг',
  'Өвөрхангай аймаг',
  'Өмнөговь аймаг',
  'Орхон аймаг',
  'Сүхбаатар аймаг',
  'Сэлэнгэ аймаг',
  'Төв аймаг',
  'Увс аймаг',
  'Ховд аймаг',
  'Хөвсгөл аймаг',
  'Хэнтий аймаг',
] as const;

export const REGIONS_BY_TYPE: Record<RegionType, readonly string[]> = {
  city: CITY_REGIONS,
  province: PROVINCE_REGIONS,
};

